Com base no DataFrame abaixo:


remova as linhas duplicadas;


altere o ID da brand W para 11;


ordene o DataFrame pela coluna Rating;


Mude o índice do DataFrame para a coluna 'ID';


converta o DataFrame para um dicionário e armazene em uma variável.

https://prnt.sc/HOMfO_wyJVGE

In [1]:
import pandas as pd
 
data = {
    'Brand': ['A', 'A', 'D', 'W', 'K'],
    'ID': [1, 1, 3, 5, 7],
    'Rating':[3.5, 3.5, 4, 8.2, 1]}
 
df = pd.DataFrame(data)

In [3]:
df.drop_duplicates(inplace = True)
df

  Brand  ID  Rating
0     A   1     3.5
2     D   3     4.0
3     W   5     8.2
4     K   7     1.0

In [4]:
df.at[3, 'ID'] = 11
df

  Brand  ID  Rating
0     A   1     3.5
2     D   3     4.0
3     W  11     8.2
4     K   7     1.0

In [5]:
df.sort_values(by = 'Rating', inplace = True)
df

  Brand  ID  Rating
4     K   7     1.0
0     A   1     3.5
2     D   3     4.0
3     W  11     8.2

In [6]:
df.set_index('ID', inplace = True)
df

   Brand  Rating
ID
7      K     1.0
1      A     3.5
3      D     4.0
11     W     8.2

In [7]:
dicionario_dados = df.to_dict()
dicionario_dados

{'Brand': {7: 'K', 1: 'A', 3: 'D', 11: 'W'},
 'Rating': {7: 1.0, 1: 3.5, 3: 4.0, 11: 8.2}}